**Q7. Rename the column 'Marks' to 'Score'.**

In [2]:
import pandas as pd

In [3]:
data = pd.DataFrame({"Name":{"0":"Amit","1":"Bhavna","2":"Chetan"},"Age":{"0":21,"1":22,"2":23},"Marks":{"0":87,"1":90,"2":85},"passed":{"0":"true","1":"true","2":"true"}})

In [5]:
data.rename(columns={'Marks':'Score'})

     Name  Age  Score passed
0    Amit   21     87   true
1  Bhavna   22     90   true
2  Chetan   23     85   true